Revit 2027 API
StructuralSectionRound.CentroidVertical Property
 Distance from centroid to the upper extremites along vertical axis.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CentroidVertical { get; set; }
Public Property CentroidVertical As Double
	Get
	Set
public:
property double CentroidVertical {
	double get ();
	void set (double value);
}
member CentroidVertical : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace